# ---- CLI 도구: 모던 대체 ----
brew "bat"           # cat 대체 (구문 강조)
brew "eza"           # ls 대체 (아이콘, 트리)
brew "fd"            # find 대체 (빠른 파일 검색)
brew "fzf"           # 퍼지 파인더
brew "git-delta"     # git diff 강화 (side-by-side)
brew "zoxide"        # cd 대체 (스마트 디렉토리 이동)

# ---- CLI 도구: tmux tokyo-night 의존성 ----
brew "bc"            # 계산기 (netspeed, git 위젯)
brew "coreutils"     # GNU 핵심 유틸리티
brew "gawk"          # GNU awk
brew "gsed"          # GNU sed
brew "jq"            # JSON 파서 (git 위젯)

# ---- CLI 도구: 쉘 환경 ----
brew "bash"          # 최신 Bash (tmux 플러그인 호환)
brew "sheldon"       # Zsh 플러그인 매니저
brew "starship"      # 크로스쉘 프롬프트
brew "stow"          # Dotfiles 심링크 관리

# ---- CLI 도구: 터미널 ----
brew "tmux"          # 터미널 멀티플렉서
brew "yazi"          # 터미널 파일 매니저
brew "lazygit"       # 터미널 Git UI

# ---- CLI 도구: 에디터 ----
brew "neovim"        # 하이퍼텍스트 에디터

# ---- CLI 도구: 런타임 & 개발 ----
brew "fnm"           # Node.js 버전 매니저

# ---- Cask: GUI 앱 ----
cask "ghostty"              # GPU 가속 터미널 에뮬레이터
cask "karabiner-elements"   # 키보드 커스터마이저

# ---- Cask: 폰트 ----
cask "font-jetbrains-mono-nerd-font"  # Nerd Font (터미널 + 에디터)
cask "font-monaspice-nerd-font"       # Nerd Font (tmux tokyo-night)
cask "font-noto-sans-symbols-2"       # 세그먼트 숫자 표시
